/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**------File Info-----------------------------------------------------------------------------------------
** File name:               hz16.h
** Latest modified Date:    2007-12-12
** Latest Version:          1.0
** Descriptions:            hz16.c接口  ASCII码字库及汉字自定义字库的应用
**
**--------------------------------------------------------------------------------------------------------
** Created by:              张展威
** Created date:            2007-12-12
** Version:                 1.0
** Descriptions:
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/

#ifndef __HZ16_H
#define __HZ16_H


#include "dataType.h"                                                   /* 定义常用数据类型及函数返回值 */

/*********************************************************************************************************
汉字字模的数据结构定义
*********************************************************************************************************/
typedef struct typefnt{                                                 /* 汉字字模数据结构             */
    unsigned char Index[2];                                             /* 汉字内码索引                 */
    unsigned char Msk[32];                                              /* 点阵码数据                   */
}FNT_GB16;

extern const FNT_GB16 GBHZ_16[];                                        /* 自定义汉字字库               */
extern const unsigned char ASCII[][16];                                 /* 自定义ASCII字库              */

extern INT16U findHzIndex(uchar *hz);                                   /* 在自定义汉字库在查找所要显示 */
                                                                        /* 的汉字的区位                 */

#endif
/*********************************************************************************************************
** End of File
*********************************************************************************************************/
